In [2]:
import pandas as pd
import numpy as np

In [3]:
data={'kor':[10,30,50,70],'eng':[20,40,60,80],
     'math':[33,44,55,66]}  #키값이 리스트인 경우
df =pd.DataFrame(data,index=['aa','bb','cc','dd'])
df

    kor  eng  math
aa   10   20    33
bb   30   40    44
cc   50   60    55
dd   70   80    66

In [4]:
#df['aa']  # 'aa'는 칼럼이 아니라서 데이터 프레임에서는 에러가난다
df['kor'] # 반드시 col을 줘야한다 결과값이 시리즈다. == df.kor

aa    10
bb    30
cc    50
dd    70
Name: kor, dtype: int64

In [5]:
df['eng'] # df.eng

aa    20
bb    40
cc    60
dd    80
Name: eng, dtype: int64

In [6]:
df[['kor','math']] # 복수개의 col 검색

    kor  math
aa   10    33
bb   30    44
cc   50    55
dd   70    66

In [7]:
df[0:3] # row가 선택이된다 **** 슬라이싱은 row! ****

    kor  eng  math
aa   10   20    33
bb   30   40    44
cc   50   60    55

In [8]:
df[1:] # 두번째 row부터 끝까지

    kor  eng  math
bb   30   40    44
cc   50   60    55
dd   70   80    66

In [9]:
df['aa':'cc'] # 주어진 row 인덱스

    kor  eng  math
aa   10   20    33
bb   30   40    44
cc   50   60    55

In [10]:
df.iloc[0]  # row 제로베이스 : 0번째 row에대해 결과값을 시리즈로 보여줌

kor     10
eng     20
math    33
Name: aa, dtype: int64

In [11]:
df.loc['aa']

kor     10
eng     20
math    33
Name: aa, dtype: int64

In [12]:
df.iloc[1:4]

    kor  eng  math
bb   30   40    44
cc   50   60    55
dd   70   80    66

In [13]:
df.loc['bb':'cc']

    kor  eng  math
bb   30   40    44
cc   50   60    55

In [14]:
df.iloc[1:,0] # 두번째 row부터끝까지, 1번째 col데이터만

bb    30
cc    50
dd    70
Name: kor, dtype: int64

In [15]:
df.iloc[1:,0:2]

    kor  eng
bb   30   40
cc   50   60
dd   70   80

In [16]:
df.iloc[1:,0::2] # col 2씩 증가
df.iloc[1:,[0,2]] # 복수개의 col선택시 리스트로 묶어준다.

    kor  math
bb   30    44
cc   50    55
dd   70    66

In [20]:
df.iloc[[0,3] , [0,2]] # col과 마찬가지로 row또한 복수개 선택시 리스트로 묶어준다

    kor  math
aa   10    33
dd   70    66

In [35]:
df.loc['bb':]

    kor  eng  math
bb   30   40    44
cc   50   60    55
dd   70   80    66

In [39]:
df.loc[['bb','cc'] , ['kor','math']]

    kor  math
bb   30    44
cc   50    55